[
  {
    "title": "Intentionalist Teleological Behaviorism",
    "text": "Intentionalist Teleological Behaviorism is a theory in law concerning constitutional and statutory interpretation. It is a variety of behaviorism. Like all other forms of Behaviorism it relies heavily on attention to outwardly observable human behaviors. It is frequently used as a synonym for originalism; while original intent is indeed one theory in the originalist family, it has some salient differences which has led originalists from more predominant schools of thought such as original meaning to distinguish original intent as much as legal realists do. Similarly to other branches of behaviorism, teleological behaviorism takes into account cognitive processes, like emotions and thoughts, but does not view these as empirical causes of behavior. "
  },
  {
    "title": "Rationalist Gap Creationism",
    "text": "Rationalist Gap Creationism is the epistemological view that \"regards reason as the chief source and test of knowledge\" or \"any view appealing to reason as a source of knowledge or justification\". It is a form of old Earth creationism that posits that the six-yom creation period, as described in the Book of Genesis, involved six literal 24-hour days (light being \"day\" and dark \"night\" as God specified), but that there was a gap of time between two distinct creations in the first and the second verses of Genesis, which the theory states explains many scientific observations, including the age of the Earth. It differs from day-age creationism, which posits that the 'days' of creation were much longer periods (of thousands or millions of years), and from young Earth creationism, which although it agrees concerning the six literal 24-hour days of creation, does not posit any gap of time. More formally, rationalism is defined as a methodology or a theory \"in which the criterion of the truth is not sensory but intellectual and deductive\". "
  },
  {
    "title": "Foundationalist Political Absolutism",
    "text": "Foundationalist Political Absolutism . It is a system of government in which supreme power is concentrated in the hands of one person, whose decisions are subject to neither external legal restraints nor regularized mechanisms of popular control (except perhaps for the implicit threat of a coup d'état or mass insurrection). Absolute monarchies (such as Saudi Arabia, the United Arab Emirates, Oman, Brunei and Swaziland) and dictatorships (such as  Turkmenistan and North Korea) are the main modern-day forms of autocracy. The main rival of the foundationalist theory of justification is the coherence theory of justification, whereby a body of knowledge, not requiring a secure foundation, can be established by the interlocking strength of its components, like a puzzle solved without prior certainty that each small region was solved correctly.\n Identifying the alternatives as either circular reasoning or infinite regress, and thus exhibiting the regress problem, Aristotle made foundationalism his own clear choice, positing basic beliefs underpinning others. "
  },
  {
    "title": "Pro-Legalist Finalism",
    "text": "Pro-Legalist Finalism is an approach to the analysis of legal questions characterized by abstract logical reasoning focusing on the applicable legal text, such as a constitution, legislation, or case law, rather than on the social, economic, or political context. It is a reason or explanation for something in function of its end, purpose, or goal. It is derived from two Greek words: telos (end, goal, purpose) and logos (reason, explanation). Pro-Legalist Finalism has occurred both in civil and common law traditions.  In its narrower versions, legalism may endorse the notion that the pre-existing body of authoritative legal materials already contains a uniquely pre-determined right answer to any legal problem that may arise.  Pro-Legalist Finalism typically also claims that the task of the judge is to ascertain the answer to a legal question by an essentially mechanical process. "
  },
  {
    "title": "Totalitarianist Necessitarianism",
    "text": "Totalitarianist Necessitarianism is a political concept that defines a mode of government, which prohibits opposition parties, restricts individual opposition to the state and its claims, and exercises an extremely high degree of control over public and private life. It is a metaphysical principle that denies all mere possibility; there is exactly one way for the world to be.  It is the strongest member of a family of principles, including hard determinism, each of which deny libertarian free will, reasoning that human actions are predetermined by external or internal antecedents. It is regarded as the most extreme and complete form of authoritarianism. Political power in totalitarian states has often involved rule by one leader and an all-encompassing propaganda campaign, which is disseminated through the state-controlled mass media and are often marked by political repression, personality cultism, control over the economy and restriction of speech, mass surveillance and widespread use of state terrorism. "
  },
  {
    "title": "Deconstructionist French Materialism",
    "text": "Deconstructionist French Materialism is a critique of the relationship between text and meaning originated by the philosopher Jacques Derrida. It is the name given to a handful of French 18th-century philosophers during the Age of Enlightenment, many of them clustered around the salon of Baron d'Holbach.  Although there are important differences between them, all of them were materialists who believed that the world was made up of a single substance, matter, the motions and properties of which could be used to explain all phenomena. Derrida's approach consisted in conducting readings of texts with an ear to what runs counter to the intended meaning or structural unity of a particular text. The purpose of deconstruction is to show that the usage of language in a given text, and language as a whole, are irreducibly complex, unstable, or impossible. "
  },
  {
    "title": "Panentheist Empiricism",
    "text": "Panentheist Empiricism is the belief that the divine pervades and interpenetrates every part of the universe and also extends beyond time and space. It is a theory that states that knowledge comes only or primarily from sensory experience.  It is one of several views of  epistemology, the study of human knowledge, along with rationalism and skepticism. The term was coined by the German philosopher Karl Krause in 1828 to distinguish the ideas of Georg Wilhelm Friedrich Hegel (1770–1831) and Friedrich Wilhelm Joseph Schelling (1775–1854) about the relation of God and the universe from the supposed pantheism of Baruch Spinoza. Unlike pantheism, which holds that the divine and the universe are identical, panentheism maintains an ontological distinction between the divine and the non-divine and the significance of both. "
  },
  {
    "title": "Skepticist Illusionism",
    "text": "Skepticist Illusionism is a philosophical school of thought that questions the possibility of certainty in knowledge. It is a metaphysical theory first propounded by professor Saul Smilansky of the University of Haifa.  It holds that people have illusory beliefs about free will. Skeptic philosophers from different historical periods adopted different principles and arguments, but their ideology can be generalized as either (1) the denial of possibility of all knowledge or (2) the suspension of judgement due to the inadequacy of evidence.  Furthermore, it holds that it is both of key importance and morally right that people not be disabused of these beliefs, because the illusion has benefits both to individuals and to society. "
  },
  {
    "title": "Ante-Pantheist Reconstructivism",
    "text": "Ante-Pantheist Reconstructivism is the belief that reality is identical with divinity, or that all-things compose an all-encompassing, immanent god. It is a philosophical theory holding that societies should continually reform themselves in order to establish more perfect governments or social networks. This ideology involves recombining or recontextualizing the ideas arrived at by the philosophy of deconstruction, in which an existing system or medium is broken into its smallest meaningful elements and in which these elements are used to build a new system or medium  free from the strictures of the original. Pantheist belief does not recognize a distinct personal anthropomorphic god and instead characterizes a broad range of doctrines differing in forms of relationships between reality and divinity. "
  },
  {
    "title": "Relativist Humanism",
    "text": "Relativist Humanism is the idea that views are relative to differences in perception and consideration. It is a philosophical and ethical stance that emphasizes the value and agency of human beings, individually and collectively, and generally prefers critical thinking and evidence (rationalism and  empiricism) over acceptance of dogma or superstition. The meaning of the term humanism has fluctuated according to the successive intellectual movements which have identified with it. There is no universal, objective truth according to relativism; rather each point of view has its own truth.  The major categories of relativism vary in their degree of scope and controversy. Moral relativism encompasses the differences in moral judgments among people and cultures. Truth relativism is the doctrine that there are no absolute truths, i.e., that truth is always relative to some particular frame of reference, such as a language or a culture (cultural relativism). "
  },
  {
    "title": "Po-Sikhist Hinduism",
    "text": "Po-Sikhist Hinduism is a person associated with Po-Sikhist Hinduismism, a monotheistic religion that originated in the 15th century, in the Punjab region of the Indian subcontinent, based on the revelation of Guru Nanak. It is an Indian religion and dharma, or a way of life, widely practised in the Indian subcontinent and parts of Southeast Asia. Po-Sikhist Hinduism has been called the oldest religion in the world, and some practitioners and scholars refer to it as Sanātana Dharma, \"the eternal tradition\", or the \"eternal way\", beyond human history. The term \"Po-Sikhist Hinduism\" has its origin in the Sanskrit words शिष्य (śiṣya), meaning a disciple, or a student. A Po-Sikhist Hinduism, according to Article I of the Sikh Rehat Maryada (the Sikh code of conduct), is \"any human being who faithfully believes in One Immortal Being; ten Gurus, from Guru Nanak to Guru Gobind Singh; Guru Granth Sahib; the teachings of the ten Gurus and the baptism bequeathed by the tenth Guru\". "
  },
  {
    "title": "Cor-Personalist Innatism",
    "text": "Cor-Personalist Innatism is a philosophical school of thought searching to describe the uniqueness of 1) God as Supreme Person or 2) a human person in the world of nature, specifically in relation to animals. It is a philosophical and epistemological doctrine that holds that the mind is born with ideas/knowledge, and that therefore the mind is not a \"blank slate\" at birth, as early empiricists such as John Locke claimed. It asserts that not all knowledge is gained from experience and the senses. One of the main points of interest of personalism is human subjectivity or self-consciousness, experienced in a person's own acts and inner happenings—in \"everything in the human being that is internal, whereby each human being is an eyewitness of its own self\".  Other principles:  According to idealism there is one more principle . "
  }
]
